In [1]:
import pandas as pd

In [2]:
s1=pd.Series([-1.2,3.7,2.5,-8.2,6.3])
s1

0   -1.2
1    3.7
2    2.5
3   -8.2
4    6.3
dtype: float64

In [3]:
s2 = pd.Series([1,2,3,4,5],index=[5,4,3,2,1])
s2

5    1
4    2
3    3
2    4
1    5
dtype: int64

In [4]:
s1.values

array([-1.2,  3.7,  2.5, -8.2,  6.3])

In [5]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
s2.iloc[1]

np.int64(2)

In [7]:
s2.loc[5:3]

5    1
4    2
3    3
dtype: int64

In [8]:
s3 = pd.Series({'小李':82, '小陈':93,'小张':91,'小曾':78,'小邓':68})
s3

小李    82
小陈    93
小张    91
小曾    78
小邓    68
dtype: int64

In [9]:
s3['小张']=95
s3.loc['小张']=94
s3

小李    82
小陈    93
小张    94
小曾    78
小邓    68
dtype: int64

In [10]:
(s3> 80)&(s3<90)

小李     True
小陈    False
小张    False
小曾    False
小邓    False
dtype: bool

In [11]:
s3.loc[(s3> 80)&(s3<90)]

小李    82
dtype: int64

In [12]:
s3.describe()

count     5.00000
mean     83.00000
std      10.86278
min      68.00000
25%      78.00000
50%      82.00000
75%      93.00000
max      94.00000
dtype: float64

In [13]:
s1=pd.Series([92,67,70,88,76],index=["小明","小红","小杰","小A","小B"])
s1
s2=pd.Series([95,85,60,79,76],index=["小明","小杰","小C","小D","小E"])
s2

小明    95
小杰    85
小C    60
小D    79
小E    76
dtype: int64

In [14]:
s1.add(s2,fill_value=0)

小A     88.0
小B     76.0
小C     60.0
小D     79.0
小E     76.0
小明    187.0
小杰    155.0
小红     67.0
dtype: float64

In [15]:
s1.max()

np.int64(92)

In [16]:
s1.min()

np.int64(67)

In [17]:
s1.mean()

np.float64(78.6)

In [18]:
s1.std()

np.float64(10.99090533122727)

In [19]:
s1.describe()

count     5.000000
mean     78.600000
std      10.990905
min      67.000000
25%      70.000000
50%      76.000000
75%      88.000000
max      92.000000
dtype: float64

In [20]:
s1=s1.add(5)
s1

小明    97
小红    72
小杰    75
小A    93
小B    81
dtype: int64

In [21]:
def grade(score):
    if score>=90: return "A"
    else: return "E"
grade(80)

'E'

In [22]:
s1 = s1.apply(grade)
s1

小明    A
小红    E
小杰    E
小A    A
小B    E
dtype: object

In [23]:
df1=pd.DataFrame({"col1":s1,"col2":s2})
df1

   col1  col2
小A    A   NaN
小B    E   NaN
小C  NaN  60.0
小D  NaN  79.0
小E  NaN  76.0
小明    A  95.0
小杰    E  85.0
小红    E   NaN

In [24]:
df1.T

       小A   小B    小C    小D    小E    小明    小杰   小红
col1    A    E   NaN   NaN   NaN     A     E    E
col2  NaN  NaN  60.0  79.0  76.0  95.0  85.0  NaN

In [25]:
df1.loc["小A","col1":"col2"]

col1      A
col2    NaN
Name: 小A, dtype: object

In [26]:
df1.loc["小B",:]

col1      E
col2    NaN
Name: 小B, dtype: object

In [27]:
df1.col2>90

小A    False
小B    False
小C    False
小D    False
小E    False
小明     True
小杰    False
小红    False
Name: col2, dtype: bool

In [28]:
df1[df1.col2>90]

   col1  col2
小明    A  95.0

In [29]:
df1[df1["col2"]>90]

   col1  col2
小明    A  95.0

In [30]:
df1.head()

   col1  col2
小A    A   NaN
小B    E   NaN
小C  NaN  60.0
小D  NaN  79.0
小E  NaN  76.0

In [31]:
name=pd.Series(["小陈","小李","小王","小张","小赵","小周"],index=["001","002","003","004","005","006"])
name

001    小陈
002    小李
003    小王
004    小张
005    小赵
006    小周
dtype: object

In [32]:
gender=pd.Series(["女","女","男","男","女","男"],index=["006","005","004","003","002","001"])
gender

006    女
005    女
004    男
003    男
002    女
001    男
dtype: object

In [33]:
height=pd.Series([172.5,168.0,178.2,181.3,161.7],index=["001","002","003","004","005"])
height

001    172.5
002    168.0
003    178.2
004    181.3
005    161.7
dtype: float64

In [34]:
students=pd.DataFrame({"姓名":name,"性别":gender,"身高":height})
students

     姓名 性别     身高
001  小陈  男  172.5
002  小李  女  168.0
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7
006  小周  女    NaN

In [35]:
print(students.index)
print(students.columns)

Index(['001', '002', '003', '004', '005', '006'], dtype='object')
Index(['姓名', '性别', '身高'], dtype='object')

In [36]:
students.T

      001    002    003    004    005  006
姓名     小陈     小李     小王     小张     小赵   小周
性别      男      女      男      男      女    女
身高  172.5  168.0  178.2  181.3  161.7  NaN

In [37]:
students["身高"]

001    172.5
002    168.0
003    178.2
004    181.3
005    161.7
006      NaN
Name: 身高, dtype: float64

In [38]:
students[["身高","性别"]]

        身高 性别
001  172.5  男
002  168.0  女
003  178.2  男
004  181.3  男
005  161.7  女
006    NaN  女

In [39]:
students.loc["003"]

姓名       小王
性别        男
身高    178.2
Name: 003, dtype: object

In [40]:
students.loc["003":"005"]

     姓名 性别     身高
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7

In [41]:
students.loc[["003","005"],"性别":"身高"]

    性别     身高
003  男  178.2
005  女  161.7

In [42]:
students.loc[["003","005"],:]

     姓名 性别     身高
003  小王  男  178.2
005  小赵  女  161.7

In [43]:
students[(students["身高"]>165) & (students["性别"]=="女")]

     姓名 性别     身高
002  小李  女  168.0

In [44]:
students.head(10)

     姓名 性别     身高
001  小陈  男  172.5
002  小李  女  168.0
003  小王  男  178.2
004  小张  男  181.3
005  小赵  女  161.7
006  小周  女    NaN

In [45]:
students["成绩"]=pd.Series(["80","90","100","90","80"],index=["001","002","003","004","005"])
students

     姓名 性别     身高   成绩
001  小陈  男  172.5   80
002  小李  女  168.0   90
003  小王  男  178.2  100
004  小张  男  181.3   90
005  小赵  女  161.7   80
006  小周  女    NaN  NaN

In [46]:
students.loc["005"]=["小赵","男",165,90]
students

     姓名 性别     身高   成绩
001  小陈  男  172.5   80
002  小李  女  168.0   90
003  小王  男  178.2  100
004  小张  男  181.3   90
005  小赵  男  165.0   90
006  小周  女    NaN  NaN

In [47]:
students=students.drop("成绩", axis=1)

In [48]:
students["考试4"]=[72,69,79,83,82,76]
students

     姓名 性别     身高  考试4
001  小陈  男  172.5   72
002  小李  女  168.0   69
003  小王  男  178.2   79
004  小张  男  181.3   83
005  小赵  男  165.0   82
006  小周  女    NaN   76

In [49]:
students.loc["007"]=["小陈","男",165,90]
students

     姓名 性别     身高  考试4
001  小陈  男  172.5   72
002  小李  女  168.0   69
003  小王  男  178.2   79
004  小张  男  181.3   83
005  小赵  男  165.0   82
006  小周  女    NaN   76
007  小陈  男  165.0   90

In [50]:
students.drop(["006","007"])

     姓名 性别     身高  考试4
001  小陈  男  172.5   72
002  小李  女  168.0   69
003  小王  男  178.2   79
004  小张  男  181.3   83
005  小赵  男  165.0   82

In [51]:
students.drop(["身高","考试4"],axis=1)

     姓名 性别
001  小陈  男
002  小李  女
003  小王  男
004  小张  男
005  小赵  男
006  小周  女
007  小陈  男

In [59]:
bonus=pd.Series({"姓名":"啊","身高":5,"性别":"x","考试4":10})
bonus[["考试4","身高"]]
pd.DataFrame({"001":bonus[["考试4","身高"]]})

    001
考试4  10
身高    5

In [60]:
students[["考试4","身高"]]=students[["考试4","身高"]].add(bonus[["考试4","身高"]])

     考试4     身高
001   82  177.5
002   79  173.0
003   89  183.2
004   93  186.3
005   92  170.0
006   86    NaN
007  100  170.0

In [54]:
students

     姓名 性别     身高  考试4
001  小陈  男  177.5   82
002  小李  女  173.0   79
003  小王  男  183.2   89
004  小张  男  186.3   93
005  小赵  男  170.0   92
006  小周  女    NaN   86
007  小陈  男  170.0  100

In [55]:
students[["考试4","身高"]].mean(axis=1)

001    129.75
002     126.0
003     136.1
004    139.65
005     131.0
006      86.0
007     135.0
dtype: object